app/Controllers/ClientesController.php

    public function buscarCliente($id = null)
    {
        $cliente = new ClientesModel();
        $datos['datos'] = $cliente->where('cliente_id', $id)->first();
---
SELECT *
FROM `clientes`
WHERE `cliente_id` = '3'
 LIMIT 1