app/Controllers/HotelesController.php

SELECT *
FROM `hoteles`
---
    public function index():string{
        $hotel=new HotelesModel();
        $datos['datos']=$hotel->findAll();

DELETE FROM `hoteles`
WHERE `hotel_id` IN ('8')
---
    public function eliminarHotel($id = null)
    {
        $hotel = new HotelesModel();
        $hotel->delete($id);

SELECT *
FROM `hoteles`
WHERE `hotel_id` = '3'
 LIMIT 1
---
    public function buscarHotel($id = null)
    {
       $hotel = new HotelesModel();
        $datos['datos'] = $hotel->where('hotel_id', $id)->first();