app/Controllers/ReservacionesController.php

SELECT *
FROM `reservaciones`
---
    public function index():string{
        $reservacion=new ReservacionesModel();
        $datos['datos']=$reservacion->findAll();

DELETE FROM `reservaciones`
WHERE `reservacion_id` IN ('2')
---
    public function eliminarReservacion($id = null)
    {
        $reservacion = new ReservacionesModel();
        $reservacion->delete($id);

SELECT *
FROM `reservaciones`
WHERE `reservacion_id` = '2'
 LIMIT 1
---
    public function buscarReservacion($id = null)
    {
        $reservacion = new ReservacionesModel();
        $datos['datos'] = $reservacion->where('reservacion_id', $id)->first();